> Using the same value for `location` [here](https://github.com/terraform-google-modules/terraform-example-foundation/pull/1181/files#diff-33946baa7f2fbb5a0ad3914349dea74434f3add9eb81f0690aacdeb020321662R56) in `storage_options` and for `location` [here](https://github.com/terraform-google-modules/terraform-example-foundation/pull/1181/files#diff-33946baa7f2fbb5a0ad3914349dea74434f3add9eb81f0690aacdeb020321662R82) in `project_options` results in no way to override values to match the previous defaults, which results in the log storage bucket in 1-org `module.logs_export.module.destination_storage[0].google_storage_bucket.bucket` needing to be replaced.
> 
> If I don't set any values, these are the plan changes:
> 
> ```terraform
>   # module.logs_export.module.destination_storage[0].google_storage_bucket.bucket must be replaced
> -/+ resource "google_storage_bucket" "bucket" {
>       - default_event_based_hold    = false -> null
>       ~ effective_labels            = {} -> (known after apply)
>       - enable_object_retention     = false -> null
>       ~ id                          = "bkt-prj-c-logging-hcia-org-logs-h6nd" -> (known after apply)
>       - labels                      = {} -> null
>       ~ location                    = "US" -> "US-EAST1" # forces replacement
>         name                        = "bkt-prj-c-logging-1234-org-logs-5678"
>       ~ project_number              = 123456789101 -> (known after apply)
>       - requester_pays              = false -> null
>       ~ rpo                         = "DEFAULT" -> (known after apply)
>       ~ self_link                   = "https://www.googleapis.com/storage/v1/b/bkt-prj-c-logging-1234-org-logs-5678" -> (known after apply)
>       ~ terraform_labels            = {} -> (known after apply)
>       ~ url                         = "gs://bkt-prj-c-logging-1234-org-logs-5678" -> (known after apply)
>         # (5 unchanged attributes hidden)
> 
>       - soft_delete_policy {
>           - effective_time             = "2024-05-08T14:43:32.090Z" -> null
>           - retention_duration_seconds = 604800 -> null
>         }
> 
>         # (2 unchanged blocks hidden)
>     }
> ```
> 
> And if I set `log_export_storage_location = "US"` we get this, which isn't valid, since the linked dataset and the log sync don't support a multi-region location (e.g. `US`) like the bucket
> 
> ```terraform
>   # module.logs_export.module.destination_aggregated_logs[0].google_logging_linked_dataset.linked_dataset[0] must be replaced
> -/+ resource "google_logging_linked_dataset" "linked_dataset" {
>       ~ bucket          = "AggregatedLogs" # forces replacement -> (known after apply) # forces replacement
>       ~ create_time     = "2024-05-08T14:45:06.171132597Z" -> (known after apply)
>       ~ id              = "projects/prj-c-logging-hcia/locations/us-east1/buckets/AggregatedLogs/links/ds_c_prj_aggregated_logs_analytics" -> (known after apply)
>       ~ lifecycle_state = "ACTIVE" -> (known after apply)
>       ~ location        = "us-east1" -> "US" # forces replacement
>       ~ name            = "projects/prj-c-logging-hcia/locations/us-east1/buckets/AggregatedLogs/links/ds_c_prj_aggregated_logs_analytics" -> (known after apply)
>         # (3 unchanged attributes hidden)
> 
>       - bigquery_dataset {
>           - dataset_id = "bigquery.googleapis.com/projects/854274779945/datasets/ds_c_prj_aggregated_logs_analytics" -> null
>         }
>     }
> 
>   # module.logs_export.module.destination_aggregated_logs[0].google_logging_project_bucket_config.bucket must be replaced
> -/+ resource "google_logging_project_bucket_config" "bucket" {
>       + description      = (known after apply)
>       ~ id               = "projects/prj-c-logging-hcia/locations/us-east1/buckets/AggregatedLogs" -> (known after apply)
>       ~ lifecycle_state  = "ACTIVE" -> (known after apply)
>       ~ location         = "us-east1" -> "US" # forces replacement
>       - locked           = false -> null
>       ~ name             = "projects/prj-c-logging-hcia/locations/us-east1/buckets/AggregatedLogs" -> (known after apply)
>         # (4 unchanged attributes hidden)
>     }
> 
>   # module.logs_export.module.internal_project_log_export[0].google_logging_project_sink.sink[0] will be updated in-place
>   ~ resource "google_logging_project_sink" "sink" {
>       ~ destination            = "logging.googleapis.com/projects/prj-c-logging-hcia/locations/us-east1/buckets/AggregatedLogs" -> "logging.googleapis.com/projects/prj-c-logging-hcia/locations/US/buckets/AggregatedLogs"
>         id                     = "projects/prj-c-logging-hcia/sinks/sk-c-logging-prj-la"
>         name                   = "sk-c-logging-prj-la"
>         # (4 unchanged attributes hidden)
>     }
> ```
> 
> which results in these errors:
> 
> ```terraform
> │ Error: googleapi: Error 400: Sink.destination uses not supported location: US, badRequest
> │
> │   with module.logs_export.module.internal_project_log_export[0].google_logging_project_sink.sink[0],
> │   on .terraform/modules/logs_export.internal_project_log_export/main.tf line 41, in resource "google_logging_project_sink" "sink":
> │   41: resource "google_logging_project_sink" "sink" {
> │
> ╵
> ╷
> │ Error: Error creating Bucket: googleapi: Error 404: Cloud Logging does not support location: US
> │
> │   with module.logs_export.module.destination_aggregated_logs[0].google_logging_project_bucket_config.bucket,
> │   on .terraform/modules/logs_export.destination_aggregated_logs/modules/logbucket/main.tf line 36, in resource "google_logging_project_bucket_config" "bucket":
> │   36: resource "google_logging_project_bucket_config" "bucket" {
> ```
> 
> If we want to support multi-region buckets, like the old default, we should change the `storage_options.location` value.

@bdashrad Good catch.

the `project_options.location`

https://github.com/nbugden/terraform-example-foundation/blob/fix/bootstrap-default-region/1-org/envs/shared/log_sinks.tf#L82
```
location                   = coalesce(var.log_export_storage_location, local.default_region)
```

should still be 
 
```
location                   = local.default_region
```

since it already reads from the remote state.

And 

```
log_export_storage_location     = "US"
billing_export_dataset_location = "US"
```

Should also be added to the `terraform.example.tfvars` file

https://github.com/nbugden/terraform-example-foundation/blob/fix/bootstrap-default-region/1-org/envs/shared/terraform.example.tfvars